Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/FastLED_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Using a Multimeter
it_it: Utilizzo di un Multimetro

source: Using brightness variation and timing to add depth and dimension to sparkle effects
it_it: Utilizzando la variazione di luminosità e la temporizzazione per aggiungere profondità e dimensione agli effetti di luccichìo

source: Using fewer LEDs
it_it: Utilizzare meno LED

source: Using parallel arrays to store state data alongside LED color data
it_it: Utilizzo di array paralleli per memorizzare i dati di stato insieme ai dati di colore dei LED

source: Using systematic diagnostic strategies: isolation testing (test components separately), binary search for bad LEDs, minimal test sketches, and frame rate/timing analysis
it_it: Utilizzo di strategie di diagnostica sistematica: test di isolamento (test dei componenti separatamente), ricerca binaria per LED difettosi, sketch di test minimi e analisi di frame rate/timing

source: Using the following generates links to API documentation that the reader can click directly in the text.
it_it: Utilizzando quanto segue si generano link alla documentazione API su cui il lettore può cliccare direttamente nel testo.

source: Using the quick troubleshooting checklist to verify basic setup before detailed debugging
it_it: Utilizzare la checklist di risoluzione rapida dei problemi per verificare la configurazione di base prima del debug dettagliato

source: Using two dimensions creates more complex, organic patterns:
it_it: L'utilizzo di due dimensioni crea pattern più complessi e organici:

source: Using welcoming and inclusive language
it_it: Utilizzare un linguaggio accogliente e inclusivo

source: Usually `millis() / divisor`
it_it: Di solito `millis() / divisore`

source: VU Meter Effect
it_it: Effetto VU Meter

source: VU Meter Variations
it_it: Variazioni del VU Meter

source: Variable Fade Rates
it_it: Velocità di Dissolvenza Variabili

source: Variable Speed
it_it: Velocità Variabile

source: Variable Speed Effects
it_it: Effetti a Velocità Variabile

source: Variations
it_it: Varianti

source: Various wave effects including sine waves, color waves, and ocean-inspired patterns.
it_it: Vari effetti di onde, tra cui onde sinusoidali, onde colorate e motivi ispirati all'oceano.

source: Various wave patterns including sine waves and color waves
it_it: Vari modelli di onde, tra cui onde sinusoidali e onde colorate

source: Verification
it_it: Verifica

source: Verify LED data array hasn't been corrupted:
it_it: Verificare che l'array di dati dei LED non sia danneggiato:

source: Verify analog pin in code matches hardware
it_it: Verificare che il pin analogico nel codice corrisponda all'hardware

source: Verify both ground and 5V are securely connected to the LED strip
it_it: Verificare che sia la massa che i 5V siano saldamente collegati alla striscia LED

source: Verify color order and values are correct:
it_it: Verificare che l'ordine e i valori dei colori siano corretti:

source: Verify color order matches strip type
it_it: Verificare che l'ordine dei colori corrisponda al tipo di striscia

source: Verify microcontroller running (blink onboard LED)
it_it: Verificare il funzionamento del microcontrollore (LED integrato lampeggiante)

source: Verify pin assignment in addLeds()
it_it: Verificare l'assegnazione dei pin in addLeds()

source: Verify power supply can handle current
it_it: Verificare che l'alimentatore possa gestire la corrente

source: Verify power supply capacity
it_it: Verifica la capacità dell'alimentatore

source: Verify your matrix wiring pattern (serpentine vs progressive)
it_it: Verificare il modello di cablaggio della matrice (serpentina o progressiva)

source: Very fast CPU (600 MHz)
it_it: CPU molto veloce (600 MHz)

source: Very fast refresh
it_it: Aggiornamento molto rapido

source: Very fast, lots of RAM
it_it: Molto veloce, molta RAM

source: Very limited RAM (2KB)
it_it: RAM molto limitata (2 KB)

source: Very long or very wide tables can be difficult to read and use.
it_it: Tabelle molto lunghe o molto larghe possono essere difficili da leggere e utilizzare.

source: View the .rst source file that generated that page by clicking the "eye" icon at the top of the page.
it_it: Visualizzare il file sorgente .rst che ha generato quella pagina cliccando sull'icona a forma di "occhio" in cima alla pagina.

source: Virtual Combined Strip
it_it: Strisce Combinate Virtuali

source: Visit `My Website <https://pro.lvgl.io>`__.
it_it: Visitare `Il Mio Sito Web <https://pro.lvgl.io>`__.

source: Visual Settings
it_it: Impostazioni Visive

source: Voltage
it_it: Tensione

source: Voltage Drop
it_it: Caduta di Tensione

source: Voltage Drop Issues
it_it: Problemi di Caduta di Tensione

source: Voltage drop - add power injection
it_it: Calo di tensione - aggiungere iniezione di potenza

source: Voltage drop and power injection
it_it: Caduta di tensione e iniezione di potenza

source: Voltage drop causes dim LEDs
it_it: La caduta di tensione causa la fioca luminosità dei LED

source: WS2812B compatible
it_it: Compatibile con WS2812B

source: WS2812B is most common, but verify your strip type
it_it: WS2812B è il più comune, ma verificare il tipo di striscia

source: Wait for installation to complete
it_it: Attendere il completamento dell'installazione

source: Wall adapter (5V, 2A)
it_it: Adattatore da parete (5 V, 2 A)

source: Want WS2812B compatibility
it_it: Si desidera la compatibilità con WS2812B

source: Want backup data line feature
it_it: È necessaria la funzionalità di linea dati di backup

source: Want better color accuracy
it_it: Si desidera una migliore precisione del colore

source: Warm white background with bright white twinkles:
it_it: Sfondo bianco caldo con brillanti scintillii bianchi:

source: Wave Across Strips
it_it: Effetto Wave tra le Strisce

source: Wave Chaser
it_it: Inseguitore d'Onda

source: Wave Functions
it_it: Funzioni d'Onda

source: Wave Patterns
it_it: Pattern di Onde

source: Wave of changing colors traveling along the strip:
it_it: Onda di colori cangianti che si muove lungo la striscia:

source: Wave patterns use trigonometric functions to create smooth, flowing motion:
it_it: I modelli di onda utilizzano funzioni trigonometriche per creare un movimento fluido e fluido:

source: Wave-Based Transitions
it_it: Transizioni Basate su Onde

source: What LED strip types are compatible and their differences
it_it: Quali tipi di strisce LED sono compatibili e le loro differenze

source: What Perlin noise is and how it differs from random values for creating smooth, organic animations
it_it: Cos'è il rumore di Perlin e in cosa si differenzia dai valori casuali per creare animazioni fluide e organiche

source: What is Perlin Noise?
it_it: Cos'è il Rumore di Perlin?

source: What to do after installation succeeds
it_it: Cosa fare dopo l'installazione

source: What to explore after completing the getting-started section
it_it: Cosa esplorare dopo aver completato la sezione introduttiva

source: What topics are covered in the getting-started section
it_it: Quali argomenti sono trattati nella sezione introduttiva

source: What's Next?
it_it: Prossimi Passi

source: When and how to apply advanced techniques for professional-quality installations
it_it: Quando e come applicare tecniche avanzate per installazioni di qualità professionale

source: When to Use HSV
it_it: Quando utilizzare HSV

source: When to Use RGB
it_it: Quando utilizzare RGB

source: When to adjust software settings (brightness, color order, power limits) vs hardware fixes
it_it: Quando regolare le impostazioni software (luminosità, ordine dei colori, limiti di potenza) rispetto alle soluzioni hardware

source: When to check common-issues.md for quick fixes vs debugging.md for systematic diagnosis
it_it: Quando consultare [common-issues.md](common-issues) per soluzioni rapide rispetto a [debugging.md](../troubleshooting/debugging) per una diagnosi sistematica

source: When to choose RGB vs HSV for different effects
it_it: Quando scegliere RGB o HSV per effetti diversi

source: When to use RGB vs HSV color models for different effects
it_it: Quando utilizzare i modelli di colore RGB e HSV per effetti diversi

source: When working with LED matrices or grids, you need to map 2D coordinates to a 1D array.
it_it: Quando si lavora con matrici o griglie LED, è necessario mappare le coordinate 2D su un array 1D.

source: Where to find help when problems persist beyond the troubleshooting guides
it_it: Dove trovare aiuto quando i problemi persistono oltre le guide alla risoluzione dei problemi

source: Which advanced troubleshooting guide to consult when quick fixes don't resolve the problem
it_it: Quale guida avanzata alla risoluzione dei problemi consultare quando le soluzioni rapide non risolvono il problema?

source: Which documents to read based on your current needs (hardware, software, or concepts)
it_it: Quali documenti leggere in base alle proprie esigenze attuali (hardware, software o concetti)

source: Which microcontrollers work with FastLED and which to choose
it_it: Quali microcontrollori funzionano con FastLED e quali scegliere

source: White Twinkle (Christmas Lights)
it_it: White Twinkle (Luci di Natale)

source: White strobe
it_it: Stroboscopio bianco

source: Why Blending Matters
it_it: Perché la Fusione è Importante

source: Why HSV color space makes rainbow effects dramatically simpler than RGB
it_it: Perché lo spazio colore HSV semplifica notevolmente gli effetti arcobaleno rispetto a RGB

source: Why HSV for Rainbows?
it_it: Perché HSV per gli Arcobaleni?

source: Why Use FastLED Math Functions?
it_it: Perché utilizzare le funzioni matematiche di FastLED?

source: Why Use Palettes?
it_it: Perché Utilizzare le Palette?

source: Why `FastLED.show()` is required to update your LED strip
it_it: Perché `FastLED.show()` è necessario per aggiornare la striscia LED

source: WiFi can cause LED glitches
it_it: Il Wi-Fi può causare problemi ai LED

source: Widely available
it_it: Ampiamente disponibile

source: Wider Scanner
it_it: Scanner più Ampio

source: Will remove the old intermediate and build files, eliminating the orphan files that would otherwise result.
it_it: Rimuoverà i vecchi file intermedi e di build, eliminando i file orfani che altrimenti si creerebbero.

source: Wiring Diagram
it_it: Schema Elettrico

source: Wiring Guidelines
it_it: Linee guida per il Cablaggio

source: Wiring best practices
it_it: Migliori pratiche di cablaggio

source: Wiring diagrams for single-wire LEDs (WS2812B family) and clock+data LEDs (APA102 family) with resistor placement
it_it: Schemi di cablaggio per LED a filo singolo (famiglia WS2812B) e LED clock+data (famiglia APA102) con resistore di posizionamento

source: Without `static`, the variable resets to 0 every loop.
it_it: Senza `static`, la variabile si reimposta a 0 a ogni ciclo.

source: Without `static`, the variable would reset to 0 every time the function is called.
it_it: enza `static`, la variabile verrebbe reimpostata a 0 ogni volta che la funzione viene chiamata.

source: Without shared ground:
it_it: Senza massa in comune:

source: Working with Ranges
it_it: Lavorare con i Range [Intervalli]

source: Working with white light displays
it_it: Lavorare con display a luce bianca

source: Wrapping at exactly column 86 is not important, but readability and ease of editing is.
it_it: Non è importante che il testo vada esattamente a capo alla colonna 86, ma lo sono la leggibilità e la facilità di modifica.

source: Write and run your first LED program with FastLED.
it_it: Scrivere ed eseguire il primo programma LED con FastLED.

source: Wrong Colors
it_it: Colori Errati

source: Wrong Colors Displayed
it_it: Colori Visualizzati Errati

source: Wrong colors displayed
it_it: Colori visualizzati errati

source: X Parameter (Spatial)
it_it: Parametro X (spaziale)

source: XY Coordinate Mapping for Matrices
it_it: Mappatura delle Coordinate XY per Matrici

source: XY Mapping Function
it_it: Funzione di Mappatura XY

source: XY coordinate mapping for matrix layouts
it_it: Mappatura delle coordinate XY per layout a matrice

source: Y Parameter (Time)
it_it: Parametro Y (Tempo)

source: Yes
it_it: Sì

source: You can also use an array of arrays for easier management:
it_it: È anche possibile utilizzare un array di array per una gestione più semplice:

source: You control LEDs by setting color values in an array:
it_it: È possibile controllare i LED impostando i valori di colore in una matrice:

source: You know the exact color you want
it_it: Si conosce esattamente il colore desiderato

source: You need precise control over each channel
it_it: Si necessita di un controllo preciso su ogni canale

source: You will find the following is a fairly-complete list of references about how to do things using reStructuredText:
it_it: Di seguito si troverà un elenco abbastanza completo di riferimenti su come utilizzare reStructuredText:

source: You're blending specific colors
it_it: Si fondono colori specifici

source: You're working with web colors or hex values
it_it: Si lavora con colori web o valori esadecimali

source: You've completed the basic patterns!
it_it: Abbiamo completato i pattern di base!

source: Your First Blink Example
it_it: Il Primo Esempio di Lampeggìo

source: Z Parameter (Extra dimension)
it_it: Parametro Z (Dimensione extra)

source: [2D/Matrix Operations](../advanced/matrix.md) - Advanced XY mapping and matrix effects
it_it: [Operazioni Matriciali/2D](../advanced/matrix) - Mappatura XY avanzata ed effetti matrice

source: [2D/Matrix Operations](advanced/matrix.md)
it_it: {doc}`Operazioni Matriciali/2D <advanced/matrix>`

source: [2D/Matrix Operations](matrix.md) - Working with LED matrices and grids, including XY mapping and 2D patterns
it_it: [Operazioni 2D/Matriciali](matrix) - Lavorare con matrici e griglie LED, inclusi mapping XY e pattern 2D

source: [API Quick Reference](api.md)
it_it: [API Quick Reference](api)

source: [API Quick Reference](api.md) - Comprehensive API function reference
it_it: [Riferimento Rapido AP](api) - Riferimento completo alle funzioni API

source: [API Quick Reference](reference/api.md)
it_it: [Riferimento rapido API](reference/api)

source: [Advanced Effects](advanced/)
it_it: {doc}`Effetti Avanzati <advanced/README>`

source: [Animations](../basic-patterns/animations.md) - Basic animation concepts and timing
it_it: [Animazioni](../basic-patterns/animations) - Concetti di base e tempi di animazione

source: [Animations](../basic-patterns/animations.md) - Static variables and timing
it_it: [Animazioni](../basic-patterns/animations) - Variabili statiche e tempi

source: [Animations](../basic-patterns/animations.md) - Static variables and timing concepts
it_it: [Animazioni](../basic-patterns/animations) - Comprensione delle variabili statiche e dei tempi

source: [Animations](../basic-patterns/animations.md) - Understanding static variables and timing
it_it: [Animazioni](../basic-patterns/animations) - Comprensione delle variabili statiche e dei tempi

source: [Animations](../basic-patterns/animations.md) - fadeToBlackBy() and timing concepts
it_it: [Animazioni](../basic-patterns/animations) - fadeToBlackBy() e concetti di temporizzazione

source: [Animations](animations.md) - Simple fade in/out effects
it_it: [Animazioni](animations) - Semplici effetti di dissolvenza in/out

source: [Animations](animations.md) - Working with static variables for animation
it_it: [Animazioni](animations) - Utilizzo di variabili statiche per l'animazione

source: [Arrays and LED Structures](../core-concepts/led-structures.md) - Working with parallel data arrays
it_it: [Array e Strutture LED](../core-concepts/led-structures) - Utilizzo di array di dati paralleli

source: [Audio Reactive Patterns](audio.md) - ⚠️ Experimental audio visualization features (alpha quality, APIs subject to change)
it_it: [Pattern Reattivi all'Audio](audio) - ⚠ Funzionalità sperimentali di visualizzazione audio (qualità alfa, API soggette a modifiche)

source: [Basic Concepts](../getting-started/concepts.md) - Understanding of FastLED fundamentals
it_it: [Concetti di Base](../getting-started/concepts) - Comprensione dei principi fondamentali di FastLED

source: [Basic Concepts](concepts.md) - Core ideas behind LED programming
it_it: [Concetti di Base](concepts) - Idee fondamentali alla base della programmazione LED

source: [Basic Concepts](concepts.md) - Understand LED programming fundamentals
it_it: [Concetti di Base](concepts) - Comprendere i fondamenti della programmazione LED

source: [Basic Concepts](getting-started/concepts.md)
it_it: {doc}`Concetti di Base <getting-started/concepts>`

source: [Basic Patterns - Animations](../basic-patterns/animations.md) - Understanding static variables and timing
it_it: [Pattern di base - Animazioni](../basic-patterns/animations) - Comprensione delle variabili statiche e della tempistica

source: [Basic Patterns: Animations](../basic-patterns/animations.md) - Understanding timing and static variables
it_it: [Pattern di Base: Animazioni](../basic-patterns/animations) - Comprensione del timing e delle variabili statiche

source: [Basic Patterns](../basic-patterns/) - Apply timing to animations
it_it: [Pattern Base](../basic-patterns/README) - Applicare la temporizzazione alle animazioni

source: [Basic Patterns](../basic-patterns/) - Create power-efficient effects
it_it: [Pattern di Base](../basic-patterns/README) - Creare effetti di risparmio energetico

source: [Basic Patterns](../basic-patterns/) - Create your first animations
it_it: [Pattern di Base](../basic-patterns/README) - Creare le prime animazioni

source: [Basic Patterns](../basic-patterns/) - Foundation pattern programming
it_it: [Pattern di Base](../basic-patterns/README) - Fondamenti della programmazione di pattern

source: [Basic Patterns](../basic-patterns/) - Pattern programming and animations
it_it: [Pattern di Base](../basic-patterns/README) - Programmazione di pattern e animazioni

source: [Basic Patterns](../basic-patterns/) - Pattern programming fundamentals
it_it: [Pattern di Base](../basic-patterns/README) - Fondamenti della programmazione dei pattern

source: [Basic Patterns](../basic-patterns/) - Solid colors, animations, chases, and rainbows
it_it: [Pattern di Base](../basic-patterns/README) - Colori pieni, animazioni, sequenze e arcobaleni

source: [Basic Patterns](../basic-patterns/) - Use arrays to create patterns
it_it: [Pattern di Base](../basic-patterns/README) - Usa le matrici per creare pattern

source: [Basic Patterns](../basic-patterns/README.md) - Understanding fill functions and animations
it_it: [Pattern di Base](../basic-patterns/README) - Comprensione delle funzioni di riempimento e delle animazioni

source: [Basic Patterns](basic-patterns/)
it_it: {doc}`Pattern di Base <basic-patterns/README>`

source: [Blending and Transitions](blending.md)
it_it: [Fusione e Transizioni](blending)

source: [Blending and Transitions](blending.md) - Combine palettes with blending techniques
it_it: [Fusione e Transizioni](blending) - Combinare palette con tecniche di fusione

source: [Blending and Transitions](blending.md) - Use math functions to control blending
it_it: [Fusione e Transizioni](blending) - Usare funzioni matematiche per controllare la fusione

source: [Blending and Transitions](intermediate/blending.md)
it_it: {doc}`Fusione e Transizioni <intermediate/blending>`

source: [Blending](../intermediate/blending.md) - Brightness variation and fade techniques
it_it: [Fusione](../intermediate/blending) - Variazione della luminosità e tecniche di dissolvenza

source: [Breathing Effect](recipes/breathing.md)
it_it: [Effetto Respiro](recipes/breathing)

source: [Chases and Scanners](basic-patterns/chases.md)
it_it: {doc}`Sequenze e Scanner <basic-patterns/chases>`

source: [Chases](chases.md) - Moving patterns and scanner effects
it_it: [Chases](chases) - Motivi di movimento ed effetti scanner

source: [Classical LED Drawing](core-concepts/led-structures.md#array-manipulation)
it_it: {doc}`Disegno LED Classico <core-concepts/led-structures>`

source: [Color Palettes](../../COOKBOOK.md#color-palettes) - Pre-defined color schemes
it_it: [Palette di Colori](../intermediate/palettes) - Schemi di colori predefiniti

source: [Color Palettes](intermediate/palettes.md)
it_it: {doc}`Palette di Colori <intermediate/palettes>`

source: [Color Palettes](palettes.md)
it_it: [Palette Colori](palettes)

source: [Color Palettes](palettes.md) - Blend between palette colors
it_it: [Palette di Colori](palettes) - Fusione tra palette di colori

source: [Color Palettes](palettes.md) - Noise is often combined with palettes for stunning effects
it_it: [Palette di Colori](palettes) - Il rumore viene spesso combinato con le palette per effetti sorprendenti

source: [Color Palettes](palettes.md) - Use beat functions to animate through palettes
it_it: [Palette di Colori](palettes) - Usare funzioni di battimento per animare le palette

source: [Color Palettes](palettes.md) - Use palettes with noise for stunning effects
it_it: [Palette di Colori](palettes) - Usare le palette con il rumore per effetti sorprendenti

source: [Color Theory](../core-concepts/color-theory.md) - HSV color space for random colors
it_it: [Teoria del Colore](../core-concepts/color-theory) - Spazio colore HSV per colori casuali

source: [Color Theory](../core-concepts/color-theory.md) - RGB and HSV color models
it_it: [Teoria del Colore](../core-concepts/color-theory) - Modelli di colore RGB e HSV

source: [Color Theory](../core-concepts/color-theory.md) - RGB vs HSV color spaces
it_it: [Teoria del Colore](../core-concepts/color-theory) - Spazi colore RGB vs HSV

source: [Color Theory](../core-concepts/color-theory.md) - Understanding HSV and RGB color models
it_it: [Teoria del Colore](../core-concepts/color-theory) - Comprensione dei modelli di colore HSV e RGB

source: [Color Theory](color-theory.md) - Learn about RGB vs HSV
it_it: [Teoria del Colore](color-theory) - Scopri RGB e HSV

source: [Color Theory](color-theory.md) - RGB vs HSV, color manipulation
it_it: [Teoria del Colore](color-theory) - RGB vs HSV, manipolazione del colore

source: [Color Theory](core-concepts/color-theory.md)
it_it: {doc}`Teoria del Colore <core-concepts/color-theory>`

source: [Common Issues and Solutions](common-issues.md)
it_it: [Problemi Comuni e Soluzioni](common-issues)

source: [Common Issues and Solutions](troubleshooting/common-issues.md)
it_it: [Problemi Comuni e Soluzioni](troubleshooting/common-issues)

source: [Common Issues](common-issues.md)
it_it: [Problemi Comuni](common-issues)

source: [Common Issues](common-issues.md) - Quick fixes for frequent problems
it_it: [Problemi Comuni](common-issues) - Soluzioni rapide per problemi frequenti

source: [Common Issues](common-issues.md) - Quick fixes that solve 80% of problems before systematic debugging needed
it_it: [Problemi Comuni](common-issues) - Soluzioni rapide che risolvono l'80% dei problemi prima che sia necessario un debug sistematico

source: [Common Issues](common-issues.md) - Quick reference for frequent problems
it_it: [Problemi Comuni](common-issues) - Guida rapida per i problemi più frequenti

source: [Common Recipes](../../COOKBOOK.md#common-recipes) - Popular effects like fire and twinkle
it_it: [Ricette Comuni](../recipes/fire) - Effetti popolari come fuoco e scintillìo

source: [Common Recipes](recipes/)
it_it: [Ricette Comuni](recipes/README)

source: [Core Concepts: Color Theory](../core-concepts/color-theory.md) - RGB and HSV color spaces
it_it: [Concetti Fondamentali: Teoria del Colore](../core-concepts/color-theory) - Spazi colore RGB e HSV
